#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <time.h>
#include <windows.h>


//位移操作符（移动二进制位数）
// 左移操作符 <<
// 右移操作符 >>

//整数的二进制有三种
//原码
//反码
//补码

//正整数的三种二进制相同
//负整数的三种二进制需要计算

//比如:7
//0000 0000 0000 0000 0000 0000 0000 0111 -> 原码
//0000 0000 0000 0000 0000 0000 0000 0111 -> 反码
//0000 0000 0000 0000 0000 0000 0000 0111 -> 补码

//-7
//1000 0000 0000 0000 0000 0000 0000 0111 -> 原码
//1111 1111 1111 1111 1111 1111 1111 1000 -> 反码（原码符号位(第一位)不变，其他位按位取反）
//1111 1111 1111 1111 1111 1111 1111 1001 -> 补码（反码+1）
//
//整数在内存中存储的是补码
//位移操作符移动补码的位数

//
//左移操作符
// 
//int main()
//{
//	//用0来补上缺失的位数
//	int a = 7;			//0000 0000 0000 0000 0000 0000 0000 0111
//	int b = a << 1;		//0000 0000 0000 0000 0000 0000 0000 1110
//
//	//a >> 1;//直接被跳过了
//	printf("%d ", a);//7
//	printf("%d ", b);//14
//
//	return 0;
//}

//int main()
//{
//	//用0来补上缺失的位数
//	int a = -7;			//1111 1111 1111 1111 1111 1111 1111 1001
//	int c = a << 1;		//1111 1111 1111 1111 1111 1111 1111 0010
//
//	//a >> 1;//直接被跳过了
//	printf("%d ", a);//-7
//	printf("%d ", c);//-14
//
//	return 0;
//}

//
//右移操作符
//算术移位 > 右边丢弃，左边补原符号位
//逻辑移位 > 右边丢弃，左边补0
// 
//vs编译器采用算术右移

//int main()
//{
//	
//	int a = -7;			//1111 1111 1111 1111 1111 1111 1111 1001
//	int c = a >> 1;		//1111 1111 1111 1111 1111 1111 1111 1000
//
//	//a >> 1;//直接被跳过了
//	printf("%d ", a);//-7
//	printf("%d ", c);//-4
//
//	return 0;
//}


// & - 按（二进制）位与
// | - 按（二进制）位或
// ^ - 按（二进制）位异或

//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//	//0000 0000 0000 0000 0000 0000 0000 0011	 3的补码
//	//1111 1111 1111 1111 1111 1111 1111 1011	-5的补码
// 
//	//0000 0000 0000 0000 0000 0000 0000 0011    3 （补码）位与的结果，对应位不足两个1按0计算，理解为且
//	printf("c=%d\n", c);
//
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a | b;
//	//0000 0000 0000 0000 0000 0000 0000 0011	 3的补码
//	//1111 1111 1111 1111 1111 1111 1111 1011	-5的补码
//	// 
//	//1111 1111 1111 1111 1111 1111 1111 1011   -5 （补码）位或的结果，对应位不足两个0按1计算，理解为或
//	printf("c=%d\n", c);
//
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a ^ b;
//	//0000 0000 0000 0000 0000 0000 0000 0011	 3的补码
//	//1111 1111 1111 1111 1111 1111 1111 1011	-5的补码
//	// 
//	//1111 1111 1111 1111 1111 1111 1111 1000   -7 （补码）位或与的结果，相同为0，相异为1
//	printf("c=%d\n", c);
//
//	return 0;
//}


//不创建第三个变量，交换2个数的值

//相同的数a异或，结果为0	a^a=0
//3^3=0
//0011		3的补码
//0011		3的补码
//
//0000
//0和任意数a异或，结果为a	0^a=a
//0^3
//0000
//0011
//
//0011

//int main()
//{
//	int a = 5;
//	int b = 8;
//	printf("交换前：a=%d,b=%d\n", a, b);
//
//	a = a + b;//a=5+8=13
//	b = a - b;//b=13-8=5
//	a = a - b;//a=13-5=8
//	printf("交换后：a=%d,b=%d\n", a, b);
//
//	a = a ^ b;//a=5^8
//	b = a ^ b;//b=5^8^8=5
//	a = a ^ b;//a=5^8^5=8
//	printf("交换后：a=%d,b=%d\n", a, b);
//
//	return 0;
//}