#define _CRT_SECURE_NO_WARNINGS
#include "head.h"

//
//合并两个有序序列，它们必须都是正序
//

//int main()
//{
//	int arr1[30] = { 1,3,5,7,9 };
//	int arr2[30] = { 0,2,4,6,8 };
//	int result[100] = { 0 };
//
//	struct Peo s1 = { "zhangsan",30,"male" };
//	struct Peo s2 = { "lisi",25,"male" };
//
//	merge_sorted_arrays(arr1, arr2, result, sizeof(arr1[0]), 40, int_cmp,is_end_int);
//
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", result[i]);
//	}
//
//	return 0;
//}

/////////////////////////////////////////////////////////////

//小乐乐改数字
//现有一个数n，小乐乐想把每位数改成0或1,，
//如果某一位是奇数，就把它变为1；偶数则变为0，请问最后得到的结果是多少
//要求：输入包含一个整数n（0<= n <= sqrt(10,9)）

//int main()
//{
//	//1.输入
//	int input = 0;
//	scanf("%d", &input);
//
//	//int sum = num_cag(input);
//	int sum = num_cag_2(input);
//
//	printf("%d\n", sum);
//	
//	return 0;
//}


/////////////////////////////////////////////////////////////


//带空格直角三角形图案
//输入一个数（2-20），表示直角三角形直角边的长度，要求多组输入
// 提示：图案用"*"



//int main()
//{
//	//多组输入
//	int input = 0;
//	while (scanf("%d", &input) == 1)
//	{
//		//打印
//		int r = 0;
//		for (r = 0; r < input; r++)
//		{
//			int c = 0;
//			for (c = 0; c < input; c++)
//			{
//				if (r + c >= input - 1)
//					printf("*");
//				else
//					printf(" ");
//			}
//			printf("\n");
//		}
//	}
//
//	return 0;
//}



/////////////////////////////////////////////////////////////


//网购
//kk在网上看上了一件衣服，如果今天是双11（11月11日），衣服打七折；
//如果是双十二（12月12日），衣服打8折，
//如果有优惠卷（只能在这两天使用），可以额外减50元，
//求kk最终花的钱，价格范围 1<= val <= 100000

//输入4个数字，第一个为衣服价格，第二和第三个当天的月份和日期，第四表示有无优惠卷（1表示有，0表示无）

//int main()
//{
//	//char arr[] = { 'h','e','l','l','o','\0' };
//	//printf("%s ", arr);
//
//	double price = 0.0;
//	int month = 0;
//	int date = 0;
//	int ticket = 0;
//
//	if (scanf("%lf %d %d %d", &price, &month, &date, &ticket) == 4)
//	{
//		if (month == 11 && date == 11)
//		{
//			price *= 0.7 - ticket * 50;
//			//有无优惠卷
//			
//		}
//		else if(month == 12 && date == 12)
//		{
//			price = price * 0.8 - ticket * 50;
//		}
//
//		//输出
//		if (price < 0.0)
//			printf("%.2lf\n", 0);
//		else
//			printf("%.2lf\n", price);
//	}
//	else
//		printf("输入错误\n");
//
//
//	return 0;
//}


/////////////////////////////////////////////////////////////


//猜名次
//A说：我第三，B第二
//B说：我第二，e第四
//c说：我第一，d第二
//d说：我第三，c最后
//e说：我第四，a第一
//每位选手说对了一半，请编程确定比赛名次

//五个位置

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	int d = 0;
//	int e = 0;
//
//	//实际上是穷举所有结果，找出符合逻辑判断的答案
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						//进行逻辑判断
//						//半真半假转换成逻辑运算时，可看做1+0（真+假）
//						if (   ((a == 3) + (b == 2) == 1)
//							&& ((b == 2) + (e == 4) == 1)
//							&& ((c == 1) + (d == 2) == 1)
//							&& ((d == 3) + (c == 5) == 1)
//							&& ((e == 4) + (a == 1) == 1))
//						{
//							//去除重合的答案
//							if (a + b + c + d + e == 15 && a*b*c*d*e==120)
//								printf("a=%d b=%d c=%d d=%d e=%d\n", a, b, c, d, e);
//						}
//					}
//				}
//			}
//		}
//
//	}
//
//	return 0;
//}



/////////////////////////////////////////////////////////////


//猜凶手
//a：不是我
//b：是c
//c：是d
//d：c说假话
//有一个人说的为假话

//每个人可能是凶手或者不是（1/0）

//int main()
//{
//	int killer = 0;
//
//	for (killer = 'a'; killer < 'd'; killer++)
//	{
//		//判断
//		if ((killer != 'a') + (killer == 'c')
//			+ (killer == 'd') + (killer != 'd') == 3)
//		{
//			printf("%c\n", killer);
//		}
//	}
//	return 0;
//}


/////////////////////////////////////////////////////////////



//杨辉三角
//   1
//  1 1 
// 1 2 1
//1 3 3 1
//...

//写一个直角三角形版的
//1
//1 1
//1 2 1
//1 3 3 1

//int main()
//{
//	int arr[10][10] = { 0 };
//
//	int i = 0;
//	int j = 0;
//
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			if (j == 0)
//				arr[i][j] = 1;
//			if (i == j)
//				arr[i][j] = 1;
//			if (i > 1 && j > 0)
//			{
//				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//			}
//		}
//	}
//
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%3d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}


