#define _CRT_SECURE_NO_WARNINGS
#include "head.h"


//模拟qsort函数的功能

//int main()
//{
//	int arr[] = { 1,5,9,3,7,21,4,8 };
//
//	int n = strlen(arr);
//
//	my_qsort(arr, n, sizeof(arr[0]), int_cmp);
//
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////




//int main()
//{
//	int aa[2][5] = { 10,9,8,7,6,5,4,3,2,1 };
//	int* ptr1 = (int*)(&aa + 1);
//	int* ptr2 = (int*)(*(aa + 1));
//
//	printf("%d %d\n", *(ptr1 - 1), *(ptr2 - 1));
//	//我的答案：1 6
//	//正确答案：1 6
//}

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//int main()
//{
//	int  arr[10][10] = { 0 };
//
//	
//	int n = 0;//行
//	int m = 0;//列
//	scanf("%d %d", &n, &m);
//
//	int i = 0;
//	int j = 0;
//	
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < m; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//
//	//输出
//	for (i = 0; i < m; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			printf("%d ", arr[j][i]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//malloc函数
//用于创建变长数组，因为vs不支持c99标准
//是stdlib.h中的函数

//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int* p = (int*)malloc(n*sizeof(int));
//	int* q = p;
//
//	int i = 0;
//	for (i = 0; i < n; i++)
//	{
//		*p++ = i;
//	}
//
//	p = q;
//
//	for (i = 0; i < n; i++)
//	{
//		printf("%d ", *p++);
//	}
//
//	free(q);
//
//	return 0;
//}


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//判断是否为上三角矩阵
// 输入：
// 3		//行、列数
// 1 2 3
// 0 4 5
// 0 0 6


//第一种方法

//int main()
//{
//	int arr[10][10] = { 0 };
//	int n = 0;
//	scanf("%d", &n);
//
//	//输入
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0;j < n; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//
//	//用行判断 j<i
//	//用列判断 j>i
//
//	//用列判断
//	for(j = 0; j < n; j++)
//	{
//		for (i = j + 1; i < n ; i++)
//		{
//			if (arr[i][j] != 0)
//			{
//				goto end;
//			}
//		}
//	}
//
//end:
//	if (j == n)
//		printf("YES\n");
//	else
//		printf("NO\n");
//
//	return 0;
//}



//第二种方法

//int main()
//{
//	int arr[10][10] = { 0 };
//	int n = 0;
//	scanf("%d", &n);
//
//	//输入
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < n; i++)
//	{
//		for (j = 0; j < n; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//
//
//	//判断
//	int flag = 1;//假设1表示为上三角
//
//	for (j = 0; j < n && flag; j++)
//	{
//		for (i = j + 1; i < n; i++)
//		{
//			if (arr[i][j] != 0)
//			{
//				flag = 0;//不是上三角
//				break;
//			}
//		}
//	}
//
//	//输出
//	if(flag==1)
//		printf("YES\n");
//	else
//		printf("NO\n");
//
//	return 0;
//}


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//有序序列判断
//输入一个整数序列，判断是否是有序序列
// 
//输入两行，第一行输入整数n
//第二行输入n个整数，空格分隔
//
//输出：有序输出sorted；无序输出unsorted

int main()
{
	//输入
	int n = 0;
	scanf("%d", &n);

	int* p = (int*)malloc(n * sizeof(n));//创建可变数组

	int i = 0;
	for (i = 0; i < n; i++)
	{
		scanf("%d", p + i);
	}

	int flag = is_sorted(p, n);

	//输出结果
	if (flag == 2)
		printf("unsorted\n");
	else
		printf("sorted\n");

	free(p);		//释放

	return 0;
}